/*Можете ли Вы ответить на эти вопросы - 3
Задана последовательность целых чисел a1, a2, ..., an (|ai| ≤ 10000 , 1 ≤ n ≤ 50000). Над ней Вам следует выполнить m (m ≤ 50000) операций:
- модифицировать i-ый элемент последовательности
- для заданных xиy вывести MAX {ai + ai+1 + ... + aj, x ≤ i ≤ j ≤ y}
Входные данные
Первая строка содержит значение n. Следующая строка содержит n целых чисел, задающих последовательность a1, a2, ..., an.
Третья строка содержит число m. Следующие m строк содержат запросы вида:
- 0 x y: изменить ax на y (|y| ≤ 10000).
- 1 x y: вывести MAX {ai + ai+1 + ... + aj, x ≤ i ≤ j ≤ y}
Выходные данные
Для каждого запроса вывести ответ как требуется в задаче.
 */
using System;

namespace _7._3._e_olymp_2907._Можете_ответить7 //by TheSkyMaks
{
    class Program //TODO
    {
        static void Main()
        {
            Console.WriteLine("Hello World!");
        }
    }
}
